--
-- PostgreSQL database dump
--

\restrict W1Ih1nh7aI4xDAFCb7kwSVYowBhRGftDVLvA6rk6E2XFabFegc6SQto4RX6as19

-- Dumped from database version 18.1 (Debian 18.1-1.pgdg13+2)
-- Dumped by pg_dump version 18.1 (Debian 18.1-1.pgdg13+2)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: заказы; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."заказы" (
    "Дата операции" date,
    "ИНН производителя" bigint,
    "Наименование производителя" text,
    "ИНН продавца" bigint,
    "Наименование продавца" text,
    "ИНН покупателя" text,
    "Наименование покупателя" text,
    "ТНВЭД" bigint,
    "GTIN" bigint,
    "Наименование товара" text,
    "Тип операции" text,
    "Объем товара, шт." integer,
    "Единицы измерения" text,
    "Объем товара, масса" numeric(12,3)
);


ALTER TABLE public."заказы" OWNER TO admin;

--
-- Name: контрагенты; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."контрагенты" (
    "ID контрагента" integer NOT NULL,
    "ИНН" bigint NOT NULL,
    "Наименование" text NOT NULL,
    "Тип контрагента" text,
    "Страна" text
);


ALTER TABLE public."контрагенты" OWNER TO admin;

--
-- Name: контрагенты_ID контрагента_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."контрагенты_ID контрагента_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."контрагенты_ID контрагента_seq" OWNER TO admin;

--
-- Name: контрагенты_ID контрагента_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."контрагенты_ID контрагента_seq" OWNED BY public."контрагенты"."ID контрагента";


--
-- Name: операции; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."операции" (
    "ID операции" integer NOT NULL,
    "Дата операции" date NOT NULL,
    "Тип операции" text,
    "ID товара" integer,
    "ID продавца" integer,
    "ID покупателя" integer,
    "Количество" integer,
    "Единица измерения" text,
    "Масса, кг" numeric(12,3),
    "Примечание" text
);


ALTER TABLE public."операции" OWNER TO admin;

--
-- Name: операции_ID операции_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."операции_ID операции_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."операции_ID операции_seq" OWNER TO admin;

--
-- Name: операции_ID операции_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."операции_ID операции_seq" OWNED BY public."операции"."ID операции";


--
-- Name: отгрузки; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."отгрузки" (
    "ID отгрузки" integer NOT NULL,
    "Дата отгрузки" date,
    "ID заказа" integer,
    "Склад" text,
    "Статус отгрузки" text,
    "Транспортная компания" text
);


ALTER TABLE public."отгрузки" OWNER TO admin;

--
-- Name: отгрузки_ID отгрузки_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."отгрузки_ID отгрузки_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."отгрузки_ID отгрузки_seq" OWNER TO admin;

--
-- Name: отгрузки_ID отгрузки_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."отгрузки_ID отгрузки_seq" OWNED BY public."отгрузки"."ID отгрузки";


--
-- Name: поставщики; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."поставщики" (
    "ID поставщика" integer NOT NULL,
    "ИНН поставщика" bigint,
    "Наименование поставщика" text,
    "Страна" text,
    "Тип сырья" text,
    "Контактное лицо" text,
    "Email" text
);


ALTER TABLE public."поставщики" OWNER TO admin;

--
-- Name: поставщики_ID поставщика_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."поставщики_ID поставщика_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."поставщики_ID поставщика_seq" OWNER TO admin;

--
-- Name: поставщики_ID поставщика_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."поставщики_ID поставщика_seq" OWNED BY public."поставщики"."ID поставщика";


--
-- Name: производственные_партии; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."производственные_партии" (
    "ID партии" integer CONSTRAINT "производственные_па_ID партии_not_null" NOT NULL,
    "ID товара" integer,
    "Дата производства" date,
    "Количество произведено" integer,
    "Масса произведено, кг" numeric(12,3),
    "Склад" text
);


ALTER TABLE public."производственные_партии" OWNER TO admin;

--
-- Name: производственные_парти_ID партии_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."производственные_парти_ID партии_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."производственные_парти_ID партии_seq" OWNER TO admin;

--
-- Name: производственные_парти_ID партии_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."производственные_парти_ID партии_seq" OWNED BY public."производственные_партии"."ID партии";


--
-- Name: склады; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."склады" (
    "ID склада" integer NOT NULL,
    "Расположение" text,
    "ID товара" integer,
    "Остаток (кол-во)" integer,
    "Остаток (масса), кг" numeric(12,3),
    "Последнее обновление" timestamp without time zone DEFAULT now()
);


ALTER TABLE public."склады" OWNER TO admin;

--
-- Name: склады_ID склада_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."склады_ID склада_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."склады_ID склада_seq" OWNER TO admin;

--
-- Name: склады_ID склада_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."склады_ID склада_seq" OWNED BY public."склады"."ID склада";


--
-- Name: товары; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public."товары" (
    "ID товара" integer NOT NULL,
    "Наименование товара" text NOT NULL,
    "Категория" text,
    "Код ТНВЭД" bigint,
    "GTIN" bigint,
    "Единица измерения" text,
    "Описание" text
);


ALTER TABLE public."товары" OWNER TO admin;

--
-- Name: товары_ID товара_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public."товары_ID товара_seq"
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public."товары_ID товара_seq" OWNER TO admin;

--
-- Name: товары_ID товара_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public."товары_ID товара_seq" OWNED BY public."товары"."ID товара";


--
-- Name: контрагенты ID контрагента; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."контрагенты" ALTER COLUMN "ID контрагента" SET DEFAULT nextval('public."контрагенты_ID контрагента_seq"'::regclass);


--
-- Name: операции ID операции; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."операции" ALTER COLUMN "ID операции" SET DEFAULT nextval('public."операции_ID операции_seq"'::regclass);


--
-- Name: отгрузки ID отгрузки; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."отгрузки" ALTER COLUMN "ID отгрузки" SET DEFAULT nextval('public."отгрузки_ID отгрузки_seq"'::regclass);


--
-- Name: поставщики ID поставщика; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."поставщики" ALTER COLUMN "ID поставщика" SET DEFAULT nextval('public."поставщики_ID поставщика_seq"'::regclass);


--
-- Name: производственные_партии ID партии; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."производственные_партии" ALTER COLUMN "ID партии" SET DEFAULT nextval('public."производственные_парти_ID партии_seq"'::regclass);


--
-- Name: склады ID склада; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."склады" ALTER COLUMN "ID склада" SET DEFAULT nextval('public."склады_ID склада_seq"'::regclass);


--
-- Name: товары ID товара; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public."товары" ALTER COLUMN "ID товара" SET DEFAULT nextval('public."товары_ID товара_seq"'::regclass);


--
-- Data for Name: заказы; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."заказы" ("Дата операции", "ИНН производителя", "Наименование производителя", "ИНН продавца", "Наименование продавца", "ИНН покупателя", "Наименование покупателя", "ТНВЭД", "GTIN", "Наименование товара", "Тип операции", "Объем товара, шт.", "Единицы измерения", "Объем товара, масса") FROM stdin;
2024-01-02	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000001	Контрагент 1	1512119100	4607001000001	Товар 1	Продажа	148	шт	388.920
2024-01-03	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000002	Контрагент 2	1512119100	4607001000002	Товар 2	Продажа	539	шт	280.390
2024-01-04	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000003	Контрагент 3	1512119100	4607001000003	Товар 3	Продажа	406	шт	397.820
2024-01-05	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000004	Контрагент 4	1512119100	4607001000004	Товар 4	Продажа	378	шт	579.640
2024-01-06	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000005	Контрагент 5	1512119100	4607001000005	Товар 5	Продажа	50	шт	241.600
2024-01-07	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000006	Контрагент 6	1512119100	4607001000006	Товар 6	Продажа	250	шт	600.840
2024-01-08	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000007	Контрагент 7	1512119100	4607001000007	Товар 7	Продажа	589	шт	3.220
2024-01-09	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000008	Контрагент 8	1512119100	4607001000008	Товар 8	Продажа	703	шт	354.360
2024-01-10	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000009	Контрагент 9	1512119100	4607001000009	Товар 9	Продажа	624	шт	442.730
2024-01-11	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000010	Контрагент 10	1512119100	4607001000010	Товар 10	Продажа	959	шт	672.650
2024-01-12	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000011	Контрагент 11	1512119100	4607001000011	Товар 11	Продажа	20	шт	630.090
2024-01-13	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000012	Контрагент 12	1512119100	4607001000012	Товар 12	Продажа	170	шт	42.690
2024-01-14	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000013	Контрагент 13	1512119100	4607001000013	Товар 13	Продажа	468	шт	303.750
2024-01-15	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000014	Контрагент 14	1512119100	4607001000014	Товар 14	Продажа	605	шт	657.410
2024-01-16	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000015	Контрагент 15	1512119100	4607001000015	Товар 15	Продажа	743	шт	704.150
2024-01-17	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000016	Контрагент 16	1512119100	4607001000016	Товар 16	Продажа	314	шт	414.100
2024-01-18	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000017	Контрагент 17	1512119100	4607001000017	Товар 17	Продажа	497	шт	383.640
2024-01-19	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000018	Контрагент 18	1512119100	4607001000018	Товар 18	Продажа	14	шт	49.770
2024-01-20	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000019	Контрагент 19	1512119100	4607001000019	Товар 19	Продажа	407	шт	385.580
2024-01-21	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000020	Контрагент 20	1512119100	4607001000020	Товар 20	Продажа	89	шт	235.090
2024-01-22	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000021	Контрагент 21	1512119100	4607001000021	Товар 21	Продажа	597	шт	35.020
2024-01-23	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000022	Контрагент 22	1512119100	4607001000022	Товар 22	Продажа	513	шт	675.090
2024-01-24	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000023	Контрагент 23	1512119100	4607001000023	Товар 23	Продажа	880	шт	128.530
2024-01-25	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000024	Контрагент 24	1512119100	4607001000024	Товар 24	Продажа	581	шт	667.260
2024-01-26	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000025	Контрагент 25	1512119100	4607001000025	Товар 25	Продажа	928	шт	611.730
2024-01-27	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000026	Контрагент 26	1512119100	4607001000026	Товар 26	Продажа	843	шт	498.320
2024-01-28	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000027	Контрагент 27	1512119100	4607001000027	Товар 27	Продажа	611	шт	599.580
2024-01-29	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000028	Контрагент 28	1512119100	4607001000028	Товар 28	Продажа	646	шт	361.310
2024-01-30	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000029	Контрагент 29	1512119100	4607001000029	Товар 29	Продажа	522	шт	356.520
2024-01-31	5834112345	ООО Биокор	5834112345	ООО Биокор	7700000030	Контрагент 30	1512119100	4607001000030	Товар 30	Продажа	834	шт	673.040
\.


--
-- Data for Name: контрагенты; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."контрагенты" ("ID контрагента", "ИНН", "Наименование", "Тип контрагента", "Страна") FROM stdin;
1	5834112345	ООО Биокор	Производитель	Россия
2	7701234567	ООО Здоровый мир	Дистрибьютор	Россия
3	7812345678	ООО ЭкоМаркет	Розница	Россия
4	5409876543	ООО ВкусВилл	Розница	Россия
5	6677889900	ООО ФармЛайн	Аптека	Россия
6	8899001122	ООО НатурПродукт	Дистрибьютор	Россия
7	9988776655	ООО АгроТрейд	Оптовик	Россия
8	1122334455	ООО ЭкоЛайф	Розница	Россия
9	2233445566	ООО Биомаркет	Розница	Россия
10	3344556677	ООО ФитоМир	Аптека	Россия
11	4455667788	ООО ЗОЖ-Плюс	Розница	Россия
12	5566778899	ООО Фермер	Оптовик	Россия
13	6677889901	ООО GreenFood	Экспорт	Казахстан
14	6677889902	ООО EcoHealth	Экспорт	Беларусь
15	6677889903	ООО NaturalWay	Экспорт	Армения
16	7701112233	ООО Вектор	Дистрибьютор	Россия
17	7702223344	ООО Альфа	Дистрибьютор	Россия
18	7703334455	ООО Бета	Дистрибьютор	Россия
19	7704445566	ООО Гамма	Розница	Россия
20	7705556677	ООО Дельта	Розница	Россия
21	7706667788	ООО Омега	Аптека	Россия
22	7707778899	ООО Сигма	Розница	Россия
23	7708889900	ООО Эпсилон	Розница	Россия
24	7710001122	ООО Каппа	Оптовик	Россия
25	7711112233	ООО Лямбда	Оптовик	Россия
26	7712223344	ООО Му	Розница	Россия
27	7713334455	ООО Ню	Розница	Россия
28	7714445566	ООО Кси	Розница	Россия
29	7715556677	ООО Омикрон	Аптека	Россия
30	7716667788	ООО Пи	Экспорт	Киргизия
\.


--
-- Data for Name: операции; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."операции" ("ID операции", "Дата операции", "Тип операции", "ID товара", "ID продавца", "ID покупателя", "Количество", "Единица измерения", "Масса, кг", "Примечание") FROM stdin;
1	2024-02-02	Продажа	2	1	3	182	шт	474.220	Синтетическая операция
2	2024-02-03	Отгрузка	3	1	4	189	шт	878.970	Синтетическая операция
3	2024-02-04	Производство	4	1	5	529	шт	490.440	Синтетическая операция
4	2024-02-05	Продажа	5	1	6	675	шт	144.510	Синтетическая операция
5	2024-02-06	Отгрузка	6	1	7	905	шт	21.580	Синтетическая операция
6	2024-02-07	Производство	7	1	8	886	шт	319.460	Синтетическая операция
7	2024-02-08	Продажа	8	1	9	731	шт	309.660	Синтетическая операция
8	2024-02-09	Отгрузка	9	1	10	625	шт	188.790	Синтетическая операция
9	2024-02-10	Производство	10	1	11	785	шт	524.830	Синтетическая операция
10	2024-02-11	Продажа	11	1	12	640	шт	300.630	Синтетическая операция
11	2024-02-12	Отгрузка	12	1	13	547	шт	43.640	Синтетическая операция
12	2024-02-13	Производство	13	1	14	9	шт	395.190	Синтетическая операция
13	2024-02-14	Продажа	14	1	15	595	шт	367.740	Синтетическая операция
14	2024-02-15	Отгрузка	15	1	16	401	шт	283.840	Синтетическая операция
15	2024-02-16	Производство	16	1	17	786	шт	675.540	Синтетическая операция
16	2024-02-17	Продажа	17	1	18	391	шт	184.510	Синтетическая операция
17	2024-02-18	Отгрузка	18	1	19	638	шт	795.510	Синтетическая операция
18	2024-02-19	Производство	19	1	20	889	шт	696.830	Синтетическая операция
19	2024-02-20	Продажа	20	1	21	581	шт	532.920	Синтетическая операция
20	2024-02-21	Отгрузка	21	1	22	610	шт	726.020	Синтетическая операция
21	2024-02-22	Производство	22	1	23	809	шт	823.650	Синтетическая операция
22	2024-02-23	Продажа	23	1	24	210	шт	804.650	Синтетическая операция
23	2024-02-24	Отгрузка	24	1	25	152	шт	447.350	Синтетическая операция
24	2024-02-25	Производство	25	1	26	631	шт	117.460	Синтетическая операция
25	2024-02-26	Продажа	26	1	27	772	шт	881.970	Синтетическая операция
26	2024-02-27	Отгрузка	27	1	28	349	шт	694.600	Синтетическая операция
27	2024-02-28	Производство	28	1	29	392	шт	792.430	Синтетическая операция
28	2024-02-29	Продажа	29	1	30	628	шт	416.540	Синтетическая операция
29	2024-03-01	Отгрузка	30	1	2	563	шт	491.620	Синтетическая операция
30	2024-03-02	Производство	1	1	3	147	шт	502.680	Синтетическая операция
\.


--
-- Data for Name: отгрузки; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."отгрузки" ("ID отгрузки", "Дата отгрузки", "ID заказа", "Склад", "Статус отгрузки", "Транспортная компания") FROM stdin;
1	2024-04-02	1	Пенза	В пути	ПЭК
2	2024-04-03	2	Пенза	Доставлено	СДЭК
3	2024-04-04	3	Пенза	В пути	Деловые линии
4	2024-04-05	4	Пенза	Доставлено	ПЭК
5	2024-04-06	5	Пенза	В пути	СДЭК
6	2024-04-07	6	Пенза	Доставлено	Деловые линии
7	2024-04-08	7	Пенза	В пути	ПЭК
8	2024-04-09	8	Пенза	Доставлено	СДЭК
9	2024-04-10	9	Пенза	В пути	Деловые линии
10	2024-04-11	10	Пенза	Доставлено	ПЭК
11	2024-04-12	11	Москва	В пути	СДЭК
12	2024-04-13	12	Москва	Доставлено	Деловые линии
13	2024-04-14	13	Москва	В пути	ПЭК
14	2024-04-15	14	Москва	Доставлено	СДЭК
15	2024-04-16	15	Москва	В пути	Деловые линии
16	2024-04-17	16	Москва	Доставлено	ПЭК
17	2024-04-18	17	Москва	В пути	СДЭК
18	2024-04-19	18	Москва	Доставлено	Деловые линии
19	2024-04-20	19	Москва	В пути	ПЭК
20	2024-04-21	20	Москва	Доставлено	СДЭК
21	2024-04-22	21	Новосибирск	В пути	Деловые линии
22	2024-04-23	22	Новосибирск	Доставлено	ПЭК
23	2024-04-24	23	Новосибирск	В пути	СДЭК
24	2024-04-25	24	Новосибирск	Доставлено	Деловые линии
25	2024-04-26	25	Новосибирск	В пути	ПЭК
26	2024-04-27	26	Новосибирск	Доставлено	СДЭК
27	2024-04-28	27	Новосибирск	В пути	Деловые линии
28	2024-04-29	28	Новосибирск	Доставлено	ПЭК
29	2024-04-30	29	Новосибирск	В пути	СДЭК
30	2024-05-01	30	Новосибирск	Доставлено	Деловые линии
\.


--
-- Data for Name: поставщики; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."поставщики" ("ID поставщика", "ИНН поставщика", "Наименование поставщика", "Страна", "Тип сырья", "Контактное лицо", "Email") FROM stdin;
1	5000000001	Поставщик сырья 1	Россия	Подсолнечник	Контакт 1	supplier1@example.ru
2	5000000002	Поставщик сырья 2	Россия	Лён	Контакт 2	supplier2@example.ru
3	5000000003	Поставщик сырья 3	Россия	Подсолнечник	Контакт 3	supplier3@example.ru
4	5000000004	Поставщик сырья 4	Россия	Лён	Контакт 4	supplier4@example.ru
5	5000000005	Поставщик сырья 5	Россия	Подсолнечник	Контакт 5	supplier5@example.ru
6	5000000006	Поставщик сырья 6	Россия	Лён	Контакт 6	supplier6@example.ru
7	5000000007	Поставщик сырья 7	Россия	Подсолнечник	Контакт 7	supplier7@example.ru
8	5000000008	Поставщик сырья 8	Россия	Лён	Контакт 8	supplier8@example.ru
9	5000000009	Поставщик сырья 9	Россия	Подсолнечник	Контакт 9	supplier9@example.ru
10	5000000010	Поставщик сырья 10	Россия	Лён	Контакт 10	supplier10@example.ru
11	5000000011	Поставщик сырья 11	Россия	Подсолнечник	Контакт 11	supplier11@example.ru
12	5000000012	Поставщик сырья 12	Россия	Лён	Контакт 12	supplier12@example.ru
13	5000000013	Поставщик сырья 13	Россия	Подсолнечник	Контакт 13	supplier13@example.ru
14	5000000014	Поставщик сырья 14	Россия	Лён	Контакт 14	supplier14@example.ru
15	5000000015	Поставщик сырья 15	Россия	Подсолнечник	Контакт 15	supplier15@example.ru
16	5000000016	Поставщик сырья 16	Россия	Лён	Контакт 16	supplier16@example.ru
17	5000000017	Поставщик сырья 17	Россия	Подсолнечник	Контакт 17	supplier17@example.ru
18	5000000018	Поставщик сырья 18	Россия	Лён	Контакт 18	supplier18@example.ru
19	5000000019	Поставщик сырья 19	Россия	Подсолнечник	Контакт 19	supplier19@example.ru
20	5000000020	Поставщик сырья 20	Россия	Лён	Контакт 20	supplier20@example.ru
21	5000000021	Поставщик сырья 21	Россия	Подсолнечник	Контакт 21	supplier21@example.ru
22	5000000022	Поставщик сырья 22	Россия	Лён	Контакт 22	supplier22@example.ru
23	5000000023	Поставщик сырья 23	Россия	Подсолнечник	Контакт 23	supplier23@example.ru
24	5000000024	Поставщик сырья 24	Россия	Лён	Контакт 24	supplier24@example.ru
25	5000000025	Поставщик сырья 25	Россия	Подсолнечник	Контакт 25	supplier25@example.ru
26	5000000026	Поставщик сырья 26	Россия	Лён	Контакт 26	supplier26@example.ru
27	5000000027	Поставщик сырья 27	Россия	Подсолнечник	Контакт 27	supplier27@example.ru
28	5000000028	Поставщик сырья 28	Россия	Лён	Контакт 28	supplier28@example.ru
29	5000000029	Поставщик сырья 29	Россия	Подсолнечник	Контакт 29	supplier29@example.ru
30	5000000030	Поставщик сырья 30	Россия	Лён	Контакт 30	supplier30@example.ru
\.


--
-- Data for Name: производственные_партии; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."производственные_партии" ("ID партии", "ID товара", "Дата производства", "Количество произведено", "Масса произведено, кг", "Склад") FROM stdin;
1	2	2024-03-02	1880	775.240	Пенза
2	3	2024-03-03	419	205.400	Пенза
3	4	2024-03-04	879	18.770	Пенза
4	5	2024-03-05	514	163.210	Пенза
5	6	2024-03-06	1610	1023.500	Пенза
6	7	2024-03-07	46	485.090	Пенза
7	8	2024-03-08	1119	1486.530	Пенза
8	9	2024-03-09	1316	168.230	Пенза
9	10	2024-03-10	1260	846.040	Пенза
10	11	2024-03-11	1292	512.460	Пенза
11	12	2024-03-12	802	382.620	Пенза
12	13	2024-03-13	889	518.660	Пенза
13	14	2024-03-14	960	495.990	Пенза
14	15	2024-03-15	691	45.270	Пенза
15	16	2024-03-16	677	744.590	Пенза
16	17	2024-03-17	739	544.530	Пенза
17	18	2024-03-18	135	394.510	Пенза
18	19	2024-03-19	143	462.360	Пенза
19	20	2024-03-20	982	421.130	Пенза
20	21	2024-03-21	295	507.740	Пенза
21	22	2024-03-22	1456	510.720	Пенза
22	23	2024-03-23	1143	1294.310	Пенза
23	24	2024-03-24	1653	764.900	Пенза
24	25	2024-03-25	1229	69.820	Пенза
25	26	2024-03-26	1869	464.060	Пенза
26	27	2024-03-27	272	942.590	Пенза
27	28	2024-03-28	1886	1423.260	Пенза
28	29	2024-03-29	42	280.200	Пенза
29	30	2024-03-30	922	272.260	Пенза
30	1	2024-03-31	941	646.500	Пенза
\.


--
-- Data for Name: склады; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."склады" ("ID склада", "Расположение", "ID товара", "Остаток (кол-во)", "Остаток (масса), кг", "Последнее обновление") FROM stdin;
1	Пенза	1	3345	1175.440	2026-01-12 14:36:05.433107
2	Пенза	2	3799	1896.890	2026-01-12 14:36:05.433107
3	Пенза	3	4844	2387.400	2026-01-12 14:36:05.433107
4	Пенза	4	126	1313.460	2026-01-12 14:36:05.433107
5	Пенза	5	4780	1021.130	2026-01-12 14:36:05.433107
6	Пенза	6	2517	2017.860	2026-01-12 14:36:05.433107
7	Пенза	7	2044	2631.430	2026-01-12 14:36:05.433107
8	Пенза	8	1398	1780.240	2026-01-12 14:36:05.433107
9	Пенза	9	1024	1553.390	2026-01-12 14:36:05.433107
10	Пенза	10	977	350.050	2026-01-12 14:36:05.433107
11	Москва	11	3094	2668.330	2026-01-12 14:36:05.433107
12	Москва	12	1366	1977.260	2026-01-12 14:36:05.433107
13	Москва	13	1405	1428.180	2026-01-12 14:36:05.433107
14	Москва	14	4527	943.340	2026-01-12 14:36:05.433107
15	Москва	15	4746	453.010	2026-01-12 14:36:05.433107
16	Москва	16	3892	173.730	2026-01-12 14:36:05.433107
17	Москва	17	1928	2773.780	2026-01-12 14:36:05.433107
18	Москва	18	2545	1896.700	2026-01-12 14:36:05.433107
19	Москва	19	2899	911.110	2026-01-12 14:36:05.433107
20	Москва	20	1037	1025.620	2026-01-12 14:36:05.433107
21	Новосибирск	21	3841	1435.650	2026-01-12 14:36:05.433107
22	Новосибирск	22	3900	9.200	2026-01-12 14:36:05.433107
23	Новосибирск	23	3006	2593.190	2026-01-12 14:36:05.433107
24	Новосибирск	24	2482	1881.890	2026-01-12 14:36:05.433107
25	Новосибирск	25	4688	1592.990	2026-01-12 14:36:05.433107
26	Новосибирск	26	3371	1842.880	2026-01-12 14:36:05.433107
27	Новосибирск	27	1483	1202.490	2026-01-12 14:36:05.433107
28	Новосибирск	28	695	2009.650	2026-01-12 14:36:05.433107
29	Новосибирск	29	3544	441.800	2026-01-12 14:36:05.433107
30	Новосибирск	30	2915	388.050	2026-01-12 14:36:05.433107
\.


--
-- Data for Name: товары; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public."товары" ("ID товара", "Наименование товара", "Категория", "Код ТНВЭД", "GTIN", "Единица измерения", "Описание") FROM stdin;
1	Масло льняное 250 мл	Масла	1512119100	4607001000011	шт	Холодный отжим
2	Масло льняное 500 мл	Масла	1512119100	4607001000012	шт	Холодный отжим
3	Масло расторопши 250 мл	Масла	1515909900	4607001000013	шт	Пищевое
4	Семена льна 200 г	Семена	1204009000	4607001000014	шт	Пищевые
5	Семена льна 400 г	Семена	1204009000	4607001000015	шт	Пищевые
6	Клетчатка льняная	БАД	2306901900	4607001000016	кг	Пищевая
7	Мука льняная	БАД	2306901900	4607001000017	кг	Обезжиренная
8	Масло тыквенное 250 мл	Масла	1515909900	4607001000018	шт	Пищевое
9	Масло кунжутное	Масла	1515509100	4607001000019	шт	Нерафинированное
10	Отруби пшеничные	БАД	2302309000	4607001000020	кг	Пищевые
11	Жмых льняной	Корма	2306901100	4607001000021	кг	Кормовой
12	Масло подсолнечное	Масла	1512119100	4607001000022	шт	Пищевое
13	Семена чиа	Семена	1207999700	4607001000023	шт	Импорт
14	Масло горчичное	Масла	1515909900	4607001000024	шт	Пищевое
15	Клетчатка овсяная	БАД	2306901900	4607001000025	кг	Растворимая
16	Льняная мука премиум	БАД	2306901900	4607001000026	кг	Тонкий помол
17	Семена подсолнечника	Семена	1206009100	4607001000027	кг	Очищенные
18	Масло кукурузное	Масла	1515211900	4607001000028	шт	Пищевое
19	Масло рапсовое	Масла	1514119000	4607001000029	шт	Пищевое
20	Жмых расторопши	Корма	2306901100	4607001000030	кг	Кормовой
21	Клетчатка гречневая	БАД	2306901900	4607001000031	кг	Пищевая
22	Мука гречневая	БАД	1104291700	4607001000032	кг	Без глютена
23	Семена кунжута	Семена	1207409000	4607001000033	кг	Пищевые
24	Масло кокосовое	Масла	1513193000	4607001000034	шт	Рафинированное
25	Отруби ржаные	БАД	2302309000	4607001000035	кг	Пищевые
26	Семена тыквы	Семена	1207999700	4607001000036	кг	Очищенные
27	Масло льняное опт	Масла	1512119100	4607001000037	л	Для B2B
28	Масло подсолнечное опт	Масла	1512119100	4607001000038	л	Для B2B
29	Жмых подсолнечный	Корма	2306901100	4607001000039	кг	Кормовой
30	Клетчатка льняная премиум	БАД	2306901900	4607001000040	кг	Очищенная
\.


--
-- Name: контрагенты_ID контрагента_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."контрагенты_ID контрагента_seq"', 1, false);


--
-- Name: операции_ID операции_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."операции_ID операции_seq"', 1, false);


--
-- Name: отгрузки_ID отгрузки_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."отгрузки_ID отгрузки_seq"', 1, false);


--
-- Name: поставщики_ID поставщика_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."поставщики_ID поставщика_seq"', 1, false);


--
-- Name: производственные_парти_ID партии_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."производственные_парти_ID партии_seq"', 1, false);


--
-- Name: склады_ID склада_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."склады_ID склада_seq"', 1, false);


--
-- Name: товары_ID товара_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public."товары_ID товара_seq"', 1, false);


--
-- PostgreSQL database dump complete
--

\unrestrict W1Ih1nh7aI4xDAFCb7kwSVYowBhRGftDVLvA6rk6E2XFabFegc6SQto4RX6as19

